app/controllers/api/stock_assets_controller.rb

  def create
    @asset = StockAsset.new(stock_asset_params)
    if @asset.save
---
INSERT INTO "stock_assets" ("owner_id", "amount", "created_at", "updated_at", "ticker", "price") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["owner_id", 15], ["amount", 1], ["created_at", "2021-04-15 03:07:11.757905"], ["updated_at", "2021-04-15 03:07:11.757905"], ["ticker", "AAPL"], ["price", 132]]

  def update
    @asset = StockAsset.find_by(id: params[:id])
    # p @asset
    @asset.amount = params[:amount].to_i

    if @asset.amount >= 0
      @asset.save!
---
SELECT  "stock_assets".* FROM "stock_assets" WHERE "stock_assets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "stock_assets" SET "amount" = $1, "updated_at" = $2 WHERE "stock_assets"."id" = $3  [["amount", 5], ["updated_at", "2021-05-21 01:59:34.378009"], ["id", 20]]

  def destroy
    @asset = StockAsset.find_by(id: params[:id])
    @asset.destroy
---
SELECT  "stock_assets".* FROM "stock_assets" WHERE "stock_assets"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
DELETE FROM "stock_assets" WHERE "stock_assets"."id" = $1  [["id", 22]]