app/controllers/api/watched_assets_controller.rb

  def create
    @watched_asset = WatchedAsset.new(watched_asset_params)
    if @watched_asset.save
---
INSERT INTO "watched_assets" ("watcher_id", "ticker", "price", "created_at", "updated_at", "category") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["watcher_id", 15], ["ticker", "WKHS"], ["price", 8], ["created_at", "2021-05-23 03:45:09.033008"], ["updated_at", "2021-05-23 03:45:09.033008"], ["category", "doodoo"]]