jasonhood/app/controllers/api/stock_assets_controller.rb

  def create
    @asset = StockAsset.new(stock_asset_params)
    if @asset.save
---
INSERT INTO "stock_assets" ("owner_id", "amount", "created_at", "updated_at", "ticker", "price") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["owner_id", 15], ["amount", 1], ["created_at", "2021-04-15 03:07:11.757905"], ["updated_at", "2021-04-15 03:07:11.757905"], ["ticker", "AAPL"], ["price", 132]]