jasonhood/app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "first_name", "last_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "users" SET "buying_power" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["buying_power", 12], ["updated_at", "2021-04-14 18:00:51.823163"], ["id", 15]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.buying_power += params[:buyingPower].to_i

    if @user.buying_power >= 0
      @user.save!